#---------------------------------------------------------------------------------------------------
# 第７章
# 以下の３つの確率変数の密度関数をヒストグラムを描いて推測する
#
# 1 ２つの一様確率変数の平均の分布
# 2 男女の身長の分布
# 3 女性の身長である正規確率変数と男性の身長である正規確率変数の和はどんな分布に従うか#
#---------------------------------------------------------------------------------------------------

import pandas as pd
import numpy as np
from numpy.random import *
import matplotlib.pyplot as plt

n_experiment=100000

#---------------------------------------------------------------------------------------------------
# ２つの一様確率変数の平均の分布
#---------------------------------------------------------------------------------------------------
# 2本の赤鉛筆を転がすという実験をn_experiment回繰り返す
aka=pd.DataFrame([ [np.random.rand(),np.random.rand()] for i in range(n_experiment)],
                    columns=['赤鉛筆1','赤鉛筆2']) 

# 2本の赤鉛筆の平均をn_experiment回計算する
aka_heikin=aka.mean(axis=1)

# ヒストグラム：2本の赤鉛筆の平均
aka_heikin.plot(kind='hist',bins=100, title='２つの一様確率変数の平均のヒストグラム')
plt.show()


#---------------------------------------------------------------------------------------------------
# 男女の身長のヒストグラムをシミュレーション
#---------------------------------------------------------------------------------------------------
double=pd.DataFrame([ [np.random.normal(155,3),np.random.normal(170,3),np.random.rand()] 
                       for i in range(n_experiment)],
                       columns=['女性の身長','男性の身長','赤鉛筆']) 

bimodal=lambda x: x['女性の身長'] if x['赤鉛筆'] <=0.5 else  x['男性の身長']

double['2峰性分布']=double.apply(bimodal,axis=1)

# ヒストグラム：2峰性分布
double['2峰性分布'].plot(kind='hist',title='男女の身長のヒストグラム（2峰性分布）',bins=100)
plt.show()


#---------------------------------------------------------------------------------------------------
# 畳み込み
# 女性の身長である正規確率変数と男性の身長である正規確率変数の和はどんな分布に従うか
#---------------------------------------------------------------------------------------------------
tatamikomi=lambda x: x['女性の身長']+x['男性の身長']

double['正規確率変数の畳み込み']=double.apply(tatamikomi,axis=1)

# ヒストグラム：正規確率変数の畳み込み
double['正規確率変数の畳み込み'].plot(kind='hist',bins=100)
plt.show()
